

ПодключитьСценарий("./../json.os", "JSON");

_преобразовательJSON = Новый JSON();



тестовыйJSON = "{
|   ""firstName"": ""Иван"",
|   ""lastName"": ""Иванов"",
|   ""address"": {
|       ""streetAddress"": ""Московское ш., 101, кв.101"",
|       ""city"": ""Ленинград"",
|       ""postalCode"": 101101
|   },
|   ""phoneNumbers"": [
|       ""812 123-1234"",
|       ""916 123-4567""
|   ]
|}";

типаОбъект = _преобразовательJSON.ПрочитатьJSON(тестовыйJSON);
Сообщить(типаОбъект);

другойТестовыйJSON = _преобразовательJSON.ЗаписатьJSON(типаОбъект);

Сообщить(другойТестовыйJSON);


